target/test-classes/xml/sws/maintainbundle/TC32598_maintain_remove_nextbilldate_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
  <soapenv:Header/>
  <soapenv:Body>
    <sel:maintainBundleRequest>
      <sel:maintainBundleAction effective="NEXTBILLDATE" acceptWarning="false">
        <sel:externalSystemId>NETCALL</sel:externalSystemId>
        <sel:accountNumber>$accountNumber$</sel:accountNumber>
        <sel:subscriptionNumber>$subscriptionNumber$</sel:subscriptionNumber>
        <sel:bundleActions>
          <sel:bundleAction actionType="REMOVE">
            <sel:group>ADDITIONAL</sel:group>
            <sel:groupCode>STANDARDDATAFC</sel:groupCode>
            <sel:bundleCode>250MB-DATA-250-FC</sel:bundleCode>
            <sel:billCapNotifications>OFF</sel:billCapNotifications>
          </sel:bundleAction>
        </sel:bundleActions>
      </sel:maintainBundleAction>
    </sel:maintainBundleRequest>
  </soapenv:Body>
</soapenv:Envelope>